{
  "name": "Bloodroot",
  "wix_url": "https://www.dreamfarmcommons.com/bloodroot",
  "pageTitle": "Bloodroot: Astral Shellmounds | Dreamfarmcommons",
  "title": "Bloodroot: Astral Shellmounds",
  "date": "November 9-30, 2018",
  "artists": "Guillermo Galindo and Amber Stucke",
  "subtitle": "a series of actions, site specific installation and an hour long performance that includes sound, language, and ritual to honor native lands",
  "eventInfo": "opening performance Friday November 9, 8PM",
  "paragraphs": [
    "Bloodroot offers an incantation to honor the native lands in the San Francisco Bay Area. Bringing to attention the site of the West Berkeley Shellmound, the location is at least one out of 425 shellmound-funerary sites of the Ohlone people in the surrounding area. Known to be older than the pyramids in Egypt, the shellmound is a resting place for their dead among other things and are still to this day believed to be buried deep within the earth. If developers succeed, a five-story building with shops, apartments, and an underground parking garage will be built on the sacred Indian village site. Currently, a coalition of Native organizations, individuals, and families are protesting the development.",
    "From a series of actions and a site specific installation that includes sound, language, and ritual, the piece establishes an imaginary navigation for the nearby site and calls to the land for the preservation of the sacred space. In an hour long performance, the piece will move throughout the gallery space to open a liminal portal of parallel connection.",
    "Bloodroot is a lunar collective created between gal*in_dog aka Guillermo Galindo and Amber Stucke. Coming from the future, the collective creates site specific installations that are activated by performances to open liminal portals with sound, language and ritual to honor and call to the land, animals, plants, and stars.",
    "We would like for the audience to keep in mind that this piece is an intimate experience and the quantity of people allowed into the gallery will be limited.",
    "The gallery, with installation, sound piece, and detritus of performance, will remain as an activated entryway --- we invite you to visit throughout the month."
  ],
  "images": [
    {
      "src": "https://static.wixstatic.com/media/2f24a0_faef90e23241401080894c9b95bb4438~mv2_d_5760_3240_s_4_2.jpg/v1/crop/x_1307,y_12,w_3640,h_3216/fill/w_309,h_273,al_c,q_80,usm_0.66_1.00_0.01,enc_avif,quality_auto/IMG_1058.jpg",
      "alt": "IMG_1058.jpg",
      "localName": "Bloodroot_1.jpg"
    },
    {
      "src": "https://static.wixstatic.com/media/2f24a0_4a338b79a14e410fb31835cb48343b70~mv2_d_1296_1296_s_2.jpg/v1/crop/x_0,y_0,w_1296,h_1094/fill/w_276,h_233,al_c,q_80,usm_0.66_1.00_0.01,enc_avif,quality_auto/Amber%20%26%20Guillermo.jpg",
      "alt": "Amber & Guillermo.jpg",
      "localName": "Bloodroot_2.jpg"
    }
  ]
}
